RT-Thread/rt-thread/bsp/nxp/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_vbat.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name FRO16K Control Interfaces
 * @{
 */

/*!
 * @brief Configure internal 16kHz free running oscillator, including enabel FRO16k, gate FRO16k output.
 *
 * @param base VBAT peripheral base address.
 * @param config Pointer to @ref vbat_fro16k_config_t structure.
 */
void VBAT_ConfigFRO16k(VBAT_Type *base, const vbat_fro16k_config_t *config);

/*!
 * @brief Enable/disable internal 16kHz free running oscillator.
 *
 * @param base VBAT peripheral base address.
 * @param enable Used to enable/disable 16kHz FRO.
 *          - \b true Enable internal 16kHz free running oscillator.
 *          - \b false Disable internal 16kHz free running oscillator.
 */
static inline void VBAT_EnableFRO16k(VBAT_Type *base, bool enable)
{
    if (enable)
    {
        base->FROCTLA |= VBAT_FROCTLA_FRO_EN_MASK;
        base->FROCTLB &= ~VBAT_FROCTLB_INVERSE_MASK;
    }
    else
    {
        base->FROCTLA &= ~VBAT_FROCTLA_FRO_EN_MASK;
        base->FROCTLB |= VBAT_FROCTLB_INVERSE_MASK;
    }
}

/*!
 * @brief Check if internal 16kHz free running oscillator is enabled.
 *
 * @param base VBAT peripheral base address.
 *
 * @retval true The internal 16kHz Free running oscillator is enabled.
 * @retval false The internal 16kHz Free running oscillator is enabled.
 */
static inline bool VBAT_CheckFRO16kEnabled(VBAT_Type *base)
{
    return (bool)((base->FROCTLA & VBAT_FROCTLA_FRO_EN_MASK) == VBAT_FROCTLA_FRO_EN_MASK);
}

/*!
 * @brief Enable FRO16kHz output clock to selected modules.
 *
 * @param base VBAT peripheral base address.
 * @param connectionsMask The mask of modules that FRO16k is connected, should be the OR'ed
 *                        value of @ref vbat_clock_enable_t.
 */
static inline void VBAT_UngateFRO16k(VBAT_Type *base, uint8_t connectionsMask)
{
    base->FROCLKE |= VBAT_FROCLKE_CLKE(connectionsMask);
}

/*!
 * @brief Disable FRO16kHz output clock to selected modules.
 *
 * @param base VBAT peripheral base address.
 * @param connectionsMask The OR'ed value of @ref vbat_clock_enable_t.
 */
static inline void VBAT_GateFRO16k(VBAT_Type *base, uint8_t connectionsMask)
{
    base->FROCLKE &= ~VBAT_FROCLKE_CLKE(connectionsMask);
}

/*!
 * @brief Lock settings of internal 16kHz free running oscillator, please note that if locked 16kHz FRO's settings can
 * not be updated until the next POR.
 *
 * @note Please note that the operation to ungate/gate FRO 16kHz output clock can not be locked by this function.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_LockFRO16kSettings(VBAT_Type *base)
{
    base->FROLCKA |= VBAT_FROLCKA_LOCK_MASK;
    base->FROLCKB &= ~VBAT_FROLCKB_LOCK_MASK;
}

/*!
 * @brief Check if FRO16K settings are locked.
 *
 * @param base VBAT peripheral base address.
 *
 * @return @c true in case of FRO16k settings are locked, @c false in case of FRO16k settings are not locked.
 */
static inline bool VBAT_CheckFRO16kSettingsLocked(VBAT_Type *base)
{
    return ((base->FROLCKA & VBAT_FROLCKA_LOCK_MASK) != 0UL);
}

/*! @} */

/*!
 * @name OSC32K Control Interfaces
 * @{
 */

/*!
 * @brief Enable/disable 32K Crystal Oscillator.
 *
 * @param base VBAT peripheral base address.
 * @param enable Used to enable/disable 32k Crystal Oscillator:
 *         - \b true Enable crystal oscillator and polling status register to check clock is ready.
 *         - \b false Disable crystal oscillator.
 */
static inline void VBAT_EnableCrystalOsc32k(VBAT_Type *base, bool enable)
{
    if (enable)
    {
        base->OSCCTLA |= VBAT_OSCCTLA_OSC_EN_MASK;
        base->OSCCTLB &= ~VBAT_OSCCTLA_OSC_EN_MASK;

        /* Polling status register to check clock is ready. */
        while ((base->STATUSA & VBAT_STATUSA_OSC_RDY_MASK) == 0UL)
            ;
    }
    else
    {
        base->OSCCTLA &= ~VBAT_OSCCTLA_OSC_EN_MASK;
        base->OSCCTLB |= VBAT_OSCCTLA_OSC_EN_MASK;
    }
}

/*!
 * @brief Bypass 32k crystal oscillator, the clock is still output by oscillator but this clock is the same as clock
 * provided on EXTAL pin.
 *
 * @note In bypass mode, oscillator must be enabled; To exit bypass mode, oscillator must be disabled.
 *
 * @param base VBAT peripheral base address.
 * @param enableBypass Used to enter/exit bypass mode:
 *          - \b true Enter into bypass mode;
 *          - \b false Exit bypass mode.
 */
static inline void VBAT_BypassCrystalOsc32k(VBAT_Type *base, bool enableBypass)
{
    if (enableBypass)
    {
        base->OSCCTLA |= (VBAT_OSCCTLA_OSC_EN_MASK | VBAT_OSCCTLA_OSC_BYP_EN_MASK);
        base->OSCCTLB &= ~(VBAT_OSCCTLA_OSC_EN_MASK | VBAT_OSCCTLA_OSC_BYP_EN_MASK);
    }
    else
    {
        base->OSCCTLA &= ~(VBAT_OSCCTLA_OSC_EN_MASK | VBAT_OSCCTLA_OSC_BYP_EN_MASK);
        base->OSCCTLB |= (VBAT_OSCCTLA_OSC_EN_MASK | VBAT_OSCCTLA_OSC_BYP_EN_MASK);
    }
}

/*!
 * @brief Adjust 32k crystal oscillator amplifier gain.
 *
 * @param base VBAT peripheral base address.
 * @param coarse Specify amplifier coarse trim value.
 * @param fine Specify amplifier fine trim value.
 */
static inline void VBAT_AdjustCrystalOsc32kAmplifierGain(VBAT_Type *base, uint8_t coarse, uint8_t fine)
{
    base->OSCCTLA = ((base->OSCCTLA & ~(VBAT_OSCCTLA_COARSE_AMP_GAIN_MASK | VBAT_OSCCTLA_FINE_AMP_GAIN_MASK)) |
                     (VBAT_OSCCTLA_COARSE_AMP_GAIN(coarse) | VBAT_OSCCTLA_FINE_AMP_GAIN(fine)));
    base->OSCCTLB = ((base->OSCCTLB & ~(VBAT_OSCCTLA_COARSE_AMP_GAIN_MASK | VBAT_OSCCTLA_FINE_AMP_GAIN_MASK)) |
                     (VBAT_OSCCTLA_COARSE_AMP_GAIN(~coarse) | VBAT_OSCCTLA_FINE_AMP_GAIN(~fine)));
}

/*!
 * @brief Set 32k crystal oscillator mode and load capacitance for the XTAL/EXTAL pin.
 *
 * @param base VBAT peripheral base address.
 * @param operateMode Specify the crystal oscillator mode, please refer to @ref vbat_osc32k_operate_mode_t.
 * @param xtalCap Specify the internal capacitance for the XTAL pin from the capacitor bank.
 * @param extalCap Specify the internal capacitance for the EXTAL pin from the capacitor bank.
 *
 * @retval kStatus_VBAT_WrongCapacitanceValue The load capacitance value to set is not align with operate mode's
 * requirements.
 * @retval kStatus_Success Success to set operate mode and load capacitance.
 */
status_t VBAT_SetCrystalOsc32kModeAndLoadCapacitance(VBAT_Type *base,
                                                     vbat_osc32k_operate_mode_t operateMode,
                                                     vbat_osc32k_load_capacitance_select_t xtalCap,
                                                     vbat_osc32k_load_capacitance_select_t extalCap);

/*!
 * @brief Trim 32k crystal oscillator startup time.
 *
 * @param base VBAT peripheral base address.
 * @param startupTime Specify the startup time of the oscillator.
 */
static inline void VBAT_TrimCrystalOsc32kStartupTime(VBAT_Type *base, vbat_osc32k_start_up_time_t startupTime)
{
    base->OSCCFGA = ((base->OSCCFGA & ~(VBAT_OSCCFGA_INIT_TRIM_MASK)) | VBAT_OSCCFGA_INIT_TRIM(startupTime));
    base->OSCCFGB = ((base->OSCCFGB & ~(VBAT_OSCCFGA_INIT_TRIM_MASK)) | VBAT_OSCCFGA_INIT_TRIM(~startupTime));
}

/*!
 * @brief Set crystal oscillator comparator trim value when oscillator is set as low power switch mode.
 *
 * @param base VBAT peripheral base address.
 * @param comparatorTrimValue Comparator trim value, ranges from 0 to 7.
 */
static inline void VBAT_SetOsc32kSwitchModeComparatorTrimValue(VBAT_Type *base, uint8_t comparatorTrimValue)
{
    base->OSCCFGA = ((base->OSCCFGA & ~VBAT_OSCCFGA_CMP_TRIM_MASK) | VBAT_OSCCFGA_CMP_TRIM(comparatorTrimValue));
    base->OSCCFGB = ((base->OSCCFGB & ~VBAT_OSCCFGA_CMP_TRIM_MASK) | VBAT_OSCCFGA_CMP_TRIM(~comparatorTrimValue));
}

/*!
 * @brief Set crystal oscillator delay trim value when oscillator is set as low power switch mode.
 *
 * @param base VBAT peripheral base address.
 * @param delayTrimValue Delay trim value, ranges from 0 to 15.
 */
static inline void VBAT_SetOsc32kSwitchModeDelayTrimValue(VBAT_Type *base, uint8_t delayTrimValue)
{
    base->OSCCFGA = ((base->OSCCFGA & ~VBAT_OSCCFGA_DLY_TRIM_MASK) | VBAT_OSCCFGA_DLY_TRIM(delayTrimValue));
    base->OSCCFGB = ((base->OSCCFGB & ~VBAT_OSCCFGA_DLY_TRIM_MASK) | VBAT_OSCCFGA_DLY_TRIM(~delayTrimValue));
}

/*!
 * @brief Set crystal oscillator capacitor trim value when oscillator is set as low power switch mode.
 *
 * @param base VBAT peripheral base address.
 * @param capacitorTrimValue Capacitor value to trim, ranges from 0 to 3.
 */
static inline void VBAT_SetOsc32kSwitchModeCapacitorTrimValue(VBAT_Type *base, uint8_t capacitorTrimValue)
{
    base->OSCCFGA = ((base->OSCCFGA & ~VBAT_OSCCFGA_CAP_TRIM_MASK) | VBAT_OSCCFGA_CAP_TRIM(capacitorTrimValue));
    base->OSCCFGB = ((base->OSCCFGB & ~VBAT_OSCCFGA_CAP_TRIM_MASK) | VBAT_OSCCFGA_CAP_TRIM(~capacitorTrimValue));
}

/*!
 * @brief Lock Osc32k settings, after locked all writes to the Oscillator registers are blocked.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_LookOsc32kSettings(VBAT_Type *base)
{
    base->OSCLCKA |= VBAT_OSCLCKA_LOCK_MASK;
    base->OSCLCKB &= ~VBAT_OSCLCKB_LOCK_MASK;
}

/*!
 * @brief Unlock Osc32k settings.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_UnlockOsc32kSettings(VBAT_Type *base)
{
    base->OSCLCKA &= ~VBAT_OSCLCKA_LOCK_MASK;
    base->OSCLCKB |= VBAT_OSCLCKB_LOCK_MASK;
}

/*!
 * @brief Check if osc32k settings are locked.
 *
 * @param base VBAT peripheral base address.
 * @return \c true in case of osc32k settings are locked, \c false in case of osc32k settings are not locked.
 */
static inline bool VBAT_CheckOsc32kSettingsLocked(VBAT_Type *base)
{
    return ((base->OSCLCKA & VBAT_OSCLCKA_LOCK_MASK) != 0UL);
}

/*!
 * @brief Enable OSC32k output clock to selected modules.
 *
 * @param base VBAT peripheral base address.
 * @param connectionsMask The OR'ed value of @ref vbat_clock_enable_t.
 */
static inline void VBAT_UngateOsc32k(VBAT_Type *base, uint8_t connectionsMask)
{
    base->OSCCLKE |= VBAT_OSCCLKE_CLKE(connectionsMask);
}

/*!
 * @brief Disable OSC32k output clock to selected modules.
 *
 * @param base VBAT peripheral base address.
 * @param connectionsMask The OR'ed value of @ref vbat_clock_enable_t.
 */
static inline void VBAT_GateOsc32k(VBAT_Type *base, uint8_t connectionsMask)
{
    base->OSCCLKE &= ~VBAT_OSCCLKE_CLKE(connectionsMask);
}

/*! @} */

/*!
 * @name RAM_LDO Control Interfaces
 * @{
 */

/*!
 * @brief Enable/disable Bandgap.
 *
 * @note The FRO16K must be enabled before enabling the bandgap.
 * @note This setting can be locked by VBAT_LockRamLdoSettings() function.
 *
 * @param base VBAT peripheral base address.
 * @param enable Used to enable/disable bandgap.
 *      - \b true Enable the bandgap.
 *      - \b false Disable the bandgap.
 *
 * @retval kStatus_Success Success to enable/disable the bandgap.
 * @retval kStatus_VBAT_Fro16kNotEnabled Fail to enable the bandgap due to FRO16k is not enabled previously.
 */
status_t VBAT_EnableBandgap(VBAT_Type *base, bool enable);

/*!
 * @brief Check if bandgap is enabled.
 *
 * @param base VBAT peripheral base address.
 *
 * @retval true The bandgap is enabled.
 * @retval false The bandgap is disabled.
 */
static inline bool VBAT_CheckBandgapEnabled(VBAT_Type *base)
{
    return (bool)((base->LDOCTLA & VBAT_LDOCTLA_BG_EN_MASK) == VBAT_LDOCTLA_BG_EN_MASK);
}

/*!
 * @brief Enable/disable bandgap low power refresh mode.
 *
 * @note For lowest power consumption, refresh mode must be enabled.
 * @note This setting can be locked by VBAT_LockRamLdoSettings() function.
 *
 * @param base VBAT peripheral base address.
 * @param enableRefreshMode Used to enable/disable bandgap low power refresh mode.
 *          - \b true Enable bandgap low power refresh mode.
 *          - \b false Disable bandgap low power refresh mode.
 */
static inline void VBAT_EnableBandgapRefreshMode(VBAT_Type *base, bool enableRefreshMode)
{
    if (enableRefreshMode)
    {
        base->LDOCTLA |= VBAT_LDOCTLA_REFRESH_EN_MASK;
        base->LDOCTLB &= ~VBAT_LDOCTLA_REFRESH_EN_MASK;
    }
    else
    {
        base->LDOCTLA &= ~VBAT_LDOCTLA_REFRESH_EN_MASK;
        base->LDOCTLB |= VBAT_LDOCTLA_REFRESH_EN_MASK;
    }
}

/*!
 * @brief Enable/disable Backup RAM Regulator(RAM_LDO).
 *
 * @note This setting can be locked by VBAT_LockRamLdoSettings() function.
 *
 * @param base VBAT peripheral base address.
 * @param enable Used to enable/disable RAM_LDO.
 *          - \b true Enable backup SRAM regulator.
 *          - \b false Disable backup SRAM regulator.
 *
 * @retval kStatusSuccess Success to enable/disable backup SRAM regulator.
 * @retval kStatus_VBAT_Fro16kNotEnabled Fail to enable backup SRAM regulator due to FRO16k is not enabled previously.
 * @retval kStatus_VBAT_BandgapNotEnabled Fail to enable backup SRAM regulator due to the bandgap is not enabled
 * previously.
 */
status_t VBAT_EnableBackupSRAMRegulator(VBAT_Type *base, bool enable);

/*!
 * @brief Lock settings of RAM_LDO, please note that if locked then RAM_LDO's settings
 * can not be updated until the next POR.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_LockRamLdoSettings(VBAT_Type *base)
{
    base->LDOLCKA |= VBAT_LDOLCKA_LOCK_MASK;
    base->LDOLCKB &= ~VBAT_LDOLCKA_LOCK_MASK;
}

/*!
 * @brief Check if RAM_LDO settings is locked.
 *
 * @param base VBAT peripheral base address.
 * @return @c true in case of RAM_LDO settings are locked, @c false in case of RAM_LDO settings are unlocked.
 */
static inline bool VBAT_CheckRamLdoSettingsLocked(VBAT_Type *base)
{
    return ((base->LDOLCKA & VBAT_LDOLCKA_LOCK_MASK) != 0UL);
}

/*!
 * @brief Switch the SRAM to be powered by LDO_RAM.
 *
 * @note This function can be used to switch the SRAM to the VBAT retention supply at any time, but please note that the
 * SRAM must not be accessed during this time.
 * @note Invoke this function to switch power supply before switching off external power.
 * @note RAM_LDO must be enabled before invoking this function.
 * @note To access the SRAM arrays retained by the LDO_RAM, please invoke VBAT_SwitchSRAMPowerBySocSupply(), after
 * external power is switched back on.
 *
 * @param base VBAT peripheral base address.
 *
 * @retval kStatusSuccess Success to Switch SRAM powered by VBAT.
 * @retval kStatus_VBAT_Fro16kNotEnabled Fail to switch SRAM powered by VBAT due to FRO16K not enabled previously.
 */
status_t VBAT_SwitchSRAMPowerByLDOSRAM(VBAT_Type *base);

/*!
 * @brief Switch the RAM to be powered by Soc Supply in software mode.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_SwitchSRAMPowerBySocSupply(VBAT_Type *base)
{
    base->LDORAMC &= ~VBAT_LDORAMC_SWI_MASK;
    base->LDORAMC &= ~VBAT_LDORAMC_ISO_MASK;
}

/*!
 * @brief Power off selected SRAM array in low power modes.
 *
 * @param base VBAT peripheral base address.
 * @param sramMask The mask of SRAM array to power off, should be the OR'ed value of @ref vbat_ram_array_t.
 */
static inline void VBAT_PowerOffSRAMsInLowPowerModes(VBAT_Type *base, uint8_t sramMask)
{
    base->LDORAMC |= VBAT_LDORAMC_RET(sramMask);
}

/*!
 * @brief Retain selected SRAM array in low power modes.
 *
 * @param base VBAT peripheral base address.
 * @param sramMask The mask of SRAM array to retain, should be the OR'ed value of @ref vbat_ram_array_t.
 */
static inline void VBAT_RetainSRAMsInLowPowerModes(VBAT_Type *base, uint8_t sramMask)
{
    base->LDORAMC &= ~VBAT_LDORAMC_RET(sramMask);
}

/*!
 * @brief Enable/disable SRAM isolation.
 *
 * @param base VBAT peripheral base address.
 * @param enable Used to enable/disable SRAM violation.
 *          - \b true SRAM will be isolated.
 *          - \b false SRAM state follows the SoC power modes.
 */
static inline void VBAT_EnableSRAMIsolation(VBAT_Type *base, bool enable)
{
    if (enable)
    {
        base->LDORAMC |= VBAT_LDORAMC_ISO_MASK;
    }
    else
    {
        base->LDORAMC &= ~VBAT_LDORAMC_ISO_MASK;
    }
}

/*! @} */

/*! @name Bandgap Timer Control Interfaces
 * @{
 */

/*!
 * @brief Enable/disable Bandgap timer.
 *
 * @note The bandgap timer is available when the bandgap is enabled and are clocked by the FRO16k.
 *
 * @param base VBAT peripheral base address.
 * @param enable Used to enable/disable bandgap timer.
 * @param timerIdMask The mask of bandgap timer Id, should be the OR'ed value of @ref vbat_bandgap_timer_id_t.
 *
 * @retval kStatus_Success Success to enable/disable selected bandgap timer.
 * @retval kStatus_VBAT_Fro16kNotEnabled Fail to enable/disable selected bandgap timer due to FRO16k not enabled
 * previously.
 * @retval kStatus_VBAT_BandgapNotEnabled Fail to enable/disable selected bandgap timer due to bandgap not enabled
 * previously.
 */
status_t VBAT_EnableBandgapTimer(VBAT_Type *base, bool enable, uint8_t timerIdMask);

/*!
 * @brief Set bandgap timer0 timeout value.
 *
 * @note The timeout value can only be changed when the timer is disabled.
 *
 * @param base VBAT peripheral base address.
 * @param timeoutPeriod Bandgap timer timeout value, please refer to @ref vbat_bandgap_timer0_timeout_period_t.
 */
void VBAT_SetBandgapTimer0TimeoutValue(VBAT_Type *base, vbat_bandgap_timer0_timeout_period_t timeoutPeriod);

/*!
 * @brief Set bandgap timer1 timeout value.
 *
 * @note The timeout value can only be changed when the timer is disabled.
 *
 * @param base VBAT peripheral base address.
 * @param timeoutPeriod The bandgap timerout 1 period, in number of seconds, ranging from 0 to 65535s.
 */
void VBAT_SetBandgapTimer1TimeoutValue(VBAT_Type *base, uint32_t timeoutPeriod);

/*! @} */

/*! @name Switch Control Interfaces
 * @{
 */

/*!
 * @brief Control the VBAT internal switch in active mode, VBAT modules can be suppiled by VDD_BAT and VDD_SYS.
 *
 * @param base VBAT peripheral base address.
 * @param supply Used to control the VBAT internal switch.
 */
static inline void VBAT_SwitchVBATModuleSupplyActiveMode(VBAT_Type *base, vbat_internal_module_supply_t supply)
{
    if (supply == kVBAT_ModuleSuppliedByVddBat)
    {
        base->SWICTLA &= ~VBAT_SWICTLA_SWI_EN_MASK;
        base->SWICTLB |= VBAT_SWICTLA_SWI_EN_MASK;
    }
    else
    {
        base->SWICTLA |= VBAT_SWICTLA_SWI_EN_MASK;
        base->SWICTLB &= ~VBAT_SWICTLA_SWI_EN_MASK;
    }
}

/*!
 * @brief Get VBAT module supply in active mode.
 *
 * @param base VBAT peripheral base address.
 * @return VDD_SYS supplies VBAT modules or VDD_BAT supplies VBAT modules, in type of @ref
 * vbat_internal_module_supply_t.
 */
static inline vbat_internal_module_supply_t VBAT_GetVBATModuleSupply(VBAT_Type *base)
{
    return (base->SWICTLA & VBAT_SWICTLA_SWI_EN_MASK);
}

/*!
 * @brief Control the VBAT internal switch in low power modes.
 *
 * @note If VBAT modules are supplied by VDD_SYS in low power modes, VBAT module will also supplied by VDD_SYS in active
 * mode.
 *
 * @param base VBAT peripheral base address.
 * @param supply Used to specify which voltage input supply VBAT modules in low power mode.
 */
static inline void VBAT_SwitchVBATModuleSupplyLowPowerMode(VBAT_Type *base, vbat_internal_module_supply_t supply)
{
    if (supply == kVBAT_ModuleSuppliedByVddBat)
    {
        base->SWICTLA &= ~VBAT_SWICTLA_LP_EN_MASK;
        base->SWICTLB |= VBAT_SWICTLA_LP_EN_MASK;
    }
    else
    {
        base->SWICTLA |= VBAT_SWICTLA_SWI_EN_MASK;
        base->SWICTLB &= ~VBAT_SWICTLA_SWI_EN_MASK;
        base->SWICTLA |= VBAT_SWICTLA_LP_EN_MASK;
        base->SWICTLB &= ~VBAT_SWICTLA_LP_EN_MASK;
    }
}

/*!
 * @brief Lock switch control, if locked all writes to the switch registers will be blocked.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_LockSwitchControl(VBAT_Type *base)
{
    base->SWILCKA |= VBAT_SWILCKA_LOCK_MASK;
    base->SWILCKB &= ~VBAT_SWILCKB_LOCK_MASK;
}

/*!
 * @brief Unlock switch control.
 *
 * @param base VBAT peripheral base address.
 */
static inline void VBAT_UnlockSwitchControl(VBAT_Type *base)
{
    base->SWILCKA &= ~VBAT_SWILCKA_LOCK_MASK;
    base->SWILCKB |= VBAT_SWILCKB_LOCK_MASK;
}

/*!
 * @brief Check if switch control is locked.
 *
 * @param base VBAT peripheral base address.
 *
 * @retval false switch control is not locked.
 * @retval true  switch control is locked, any writes to related registers are blocked.
 */
static inline bool VBAT_CheckSwitchControlLocked(VBAT_Type *base)
{
    return ((base->SWILCKA & VBAT_SWILCKA_LOCK_MASK) != 0UL);
}

/*! @} */

